In [ ]:
# stand-alone package, not requiring a compiler or external libraries, by installing the psycopg2-binary package. This
# will install a pre-compiled binary version of the module which does not require the build or runtime prerequisites
# !pip install psycopg2-binary

In [ ]:
# install sqlalchemy SQL Toolkit and Object Relational Mapper
# !pip install sqlalchemy

In [15]:
# Dependencies

# SQL Alchemy
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

from config import user, passw

In [16]:
# 1. Connection to postgres DB
# adding database name

connection_string = (f'postgres://{user}:{passw}@localhost:5432/Homework_SQL_db')
engine = create_engine(connection_string)                     
conn = engine.connect()

In [17]:
# 2. Import the SQL database into Pandas.
# select records from titles.csv to dataframe

titles_df = pd.read_sql("SELECT * FROM titles", conn)

titles_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [18]:
# 3. Import the SQL database into Pandas.
# select records from salaries.csv to dataframe

salary_df = pd.read_sql("SELECT * FROM salaries", conn)
salary_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228